In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv("sample.csv")

In [3]:
print(df.isnull().sum())

SNO       0
NAME      1
AGE       1
SALARY    1
dtype: int64

In [4]:
print(df.head())

   SNO    NAME   AGE   SALARY
0    1    Arun  23.0  80000.0
1    2   Arjun  21.0  62000.0
2    3     NaN  42.0  70000.0
3    4  Roshan  35.0  56000.0
4    5     Ram  56.0  10000.0

In [5]:
print(df.fillna(0))

   SNO    NAME   AGE    SALARY
0    1    Arun  23.0   80000.0
1    2   Arjun  21.0   62000.0
2    3       0  42.0   70000.0
3    4  Roshan  35.0   56000.0
4    5     Ram  56.0   10000.0
5    6   Maggi  15.0       0.0
6    7   Nikki  34.0  100000.0
7    8   Ramya  27.0   34000.0
8    9  Varsha  20.0   40000.0
9   10    Ajay   0.0   12000.0

In [6]:
a=df['AGE'].mean()
a

30.333333333333332

In [7]:
print(df['AGE'].fillna(a))

0    23.000000
1    21.000000
2    42.000000
3    35.000000
4    56.000000
5    15.000000
6    34.000000
7    27.000000
8    20.000000
9    30.333333
Name: AGE, dtype: float64

In [8]:
print(df['NAME'].fillna('Queen'))

0      Arun
1     Arjun
2     Queen
3    Roshan
4       Ram
5     Maggi
6     Nikki
7     Ramya
8    Varsha
9      Ajay
Name: NAME, dtype: object

In [9]:
c=df['SALARY'].mean()
c

51555.555555555555

In [10]:
print(df['SALARY'].fillna(c))

0     80000.000000
1     62000.000000
2     70000.000000
3     56000.000000
4     10000.000000
5     51555.555556
6    100000.000000
7     34000.000000
8     40000.000000
9     12000.000000
Name: SALARY, dtype: float64

#### fillna()--The fillna() function is a method provided by the pandas library in Python. It is used to fill missing or null values in a DataFrame or Series with specified values.
#### we can replace it with mean,0 etc